Тест_ЗУП_31_КОРП/src/Catalogs/ПравилаИнтеграцииС1СДокументооборотом/ПравилаИнтеграцииС1СДокументооборотом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаИнтеграцииС1СДокументооборотом</name>
  <attributes>
    <name>ТипОбъектаПотребителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбъектаДокументооборота</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФайловСохраненияПечатныхФорм</name>
    <type>
      <types>EnumRef.ТипыФайловСохраненияПечатныхФормОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьИзменения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЗапрещаетИзменение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонТип</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПрименимостиПриВыгрузке</name>
    <comment>Выражение на встроенном языке, определяющее применимость правила при выгрузке в 1С:Документооборот</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПрименимостиПриЗагрузке</name>
    <comment>Выражение на встроенном языке, определяющее применимость правила при загрузке из 1С:Документооборота</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъектаПотребителя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеОбъектаДокументооборота</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьСвязиПоСсылкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПравилаЗаполненияРеквизитовПриВыгрузке</name>
    <attributes>
      <name>ИмяРеквизитаОбъектаДокументооборота</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПравилаЗаполненияРеквизитов</name>
      <type>
        <types>EnumRef.ВариантыПравилЗаполненияРеквизитов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаОбъектаПотребителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизитаДокументооборота</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторЗначенияРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗначенияРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычисляемоеВыражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитОбъекта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитОбъектаСвойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборота</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборотаID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборотаТип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбновлятьЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаполненВШаблоне</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключевой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонЗначение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонИдентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШаблонТип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПравилаЗаполненияРеквизитовПриЗагрузке</name>
    <attributes>
      <name>ИмяРеквизитаОбъектаПотребителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантПравилаЗаполненияРеквизитов</name>
      <type>
        <types>EnumRef.ВариантыПравилЗаполненияРеквизитов</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизитаОбъектаДокументооборота</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеРеквизитаПотребителя</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВычисляемоеВыражение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборота</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборотаID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитДокументооборотаТип</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитОбъекта</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДополнительныйРеквизитОбъектаСвойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновлятьЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключевой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПрисоединяемыеПечатныеФормы</name>
    <attributes>
      <name>МенеджерПечати</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяКоманды</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеКоманды</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбновлятьЗначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Enums/ВариантыПравилЗаполненияРеквизитов/ВариантыПравилЗаполненияРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыПравилЗаполненияРеквизитов</name>
  <enumValues>
    <name>РеквизитОбъекта</name>
  </enumValues>
  <enumValues>
    <name>УказанноеЗначение</name>
  </enumValues>
  <enumValues>
    <name>ВыражениеНаВстроенномЯзыке</name>
  </enumValues>
  <enumValues>
    <name>ИзШаблона</name>
  </enumValues>
</mdclass:Enum>

Тест_ЗУП_31_КОРП/src/Catalogs/ПравилаИнтеграцииС1СДокументооборотом/Forms/ФормаПравилаЗагрузки/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("ТипОбъектаДокументооборота", ТипОбъектаДокументооборота);
	Параметры.Свойство("ВариантПравилаЗаполненияРеквизитов", ВариантПравилаЗаполненияРеквизитов);
	Параметры.Свойство("ПредставлениеРеквизитаОбъектаПотребителя", ПредставлениеРеквизитаОбъектаПотребителя);
	Параметры.Свойство("ТипРеквизитаОбъектаПотребителя", ТипРеквизитаОбъектаПотребителя);
	Параметры.Свойство("ИмяРеквизитаОбъектаДокументооборота", ИмяРеквизитаОбъектаДокументооборота);
	Параметры.Свойство("ПредставлениеРеквизитаОбъектаДокументооборота", ПредставлениеРеквизитаОбъектаДокументооборота);
	Параметры.Свойство("ЗначениеРеквизитаПотребителя", ЗначениеРеквизитаПотребителя);
	Параметры.Свойство("ВычисляемоеВыражение", ВычисляемоеВыражение);
	Параметры.Свойство("ОбновлятьЗначение", ОбновлятьЗначение);
	Параметры.Свойство("РеквизитыОбъектаДокументооборота", РеквизитыОбъектаДокументооборота);
	
	Параметры.Свойство("ДополнительныйРеквизитДокументооборота", ДополнительныйРеквизитДокументооборота);
	Параметры.Свойство("ДополнительныйРеквизитДокументооборотаID", ДополнительныйРеквизитДокументооборотаID);
	Параметры.Свойство("ДополнительныйРеквизитДокументооборотаТип", ДополнительныйРеквизитДокументооборотаТип);
	Параметры.Свойство("ДополнительныйРеквизитОбъекта", ДополнительныйРеквизитОбъекта);
	Параметры.Свойство("ДополнительныйРеквизитОбъектаСвойство", ДополнительныйРеквизитОбъектаСвойство);
	
	Параметры.Свойство("Ключевой", Ключевой);
	
	РеквизитОбъекта = ПредопределенноеЗначение("Перечисление.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта");
	УказанноеЗначение = ПредопределенноеЗначение("Перечисление.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение");
	ВыражениеНаВстроенномЯзыке = ПредопределенноеЗначение("Перечисление.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке");
	НеЗаполнять = ПредопределенноеЗначение("Перечисление.ВариантыПравилЗаполненияРеквизитов.ПустаяСсылка");
	
	ЗначениеРеквизитаПотребителя = ТипРеквизитаОбъектаПотребителя.ПривестиЗначение(ЗначениеРеквизитаПотребителя);
	
	// Настроим поле ввода для примитивных типов.
	ПервыйТип = ТипРеквизитаОбъектаПотребителя.Типы()[0];
	Если ПервыйТип = Тип("Число")
		Или ПервыйТип = Тип("Дата") Тогда
		Элементы.ЗначениеРеквизитаПотребителя.КнопкаРегулирования = Истина;
	КонецЕсли;
	
	СокращенноеНаименованиеКонфигурации = ИнтеграцияС1СДокументооборот.СокращенноеНаименованиеКонфигурации();
	Если ЗначениеЗаполнено(СокращенноеНаименованиеКонфигурации) Тогда
		Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Правило заполнения реквизита %1'"), СокращенноеНаименованиеКонфигурации);
	КонецЕсли;
	
	// Ограничим выбор вариантов заполнения и флажка Ключевой.
	Если ВариантПравилаЗаполненияРеквизитов = ВыражениеНаВстроенномЯзыке
		Или ВариантПравилаЗаполненияРеквизитов = РеквизитОбъекта
		Или ВариантПравилаЗаполненияРеквизитов = НеЗаполнять Тогда
		Элементы.Ключевой.Доступность = Ложь;
	Иначе
		Элементы.Ключевой.Доступность = Истина;
	КонецЕсли;
	ДоступенФункционалОбмен = ИнтеграцияС1СДокументооборотПовтИсп.ДоступенФункционалВерсииСервиса("1.3.2.3.CORP");
	Элементы.ОбновлятьЗначение.Видимость = ДоступенФункционалОбмен;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

&НаКлиенте
Процедура КлючевойПриИзменении(Элемент)
	
	Если Ключевой Тогда
		ВариантПравилаЗаполненияРеквизитов = УказанноеЗначение;
		УстановитьДоступность();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантПравилаЗаполненияРеквизитовПриИзменении(Элемент)
	
	Если ВариантПравилаЗаполненияРеквизитов = ВыражениеНаВстроенномЯзыке
		Или ВариантПравилаЗаполненияРеквизитов = РеквизитОбъекта
		Или ВариантПравилаЗаполненияРеквизитов = НеЗаполнять Тогда
		Ключевой = Ложь;
		Элементы.Ключевой.Доступность = Ложь;
	Иначе
		Элементы.Ключевой.Доступность = Истина;
	КонецЕсли;
	
	ОбновлятьЗначение =
		ДоступенФункционалОбмен
		И (ОбновлятьЗначение Или ВариантПравилаЗаполненияРеквизитов = РеквизитОбъекта)
		И Не (ВариантПравилаЗаполненияРеквизитов = НеЗаполнять)
		И Не (ВариантПравилаЗаполненияРеквизитов = УказанноеЗначение);
		
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеРеквизитаОбъектаДокументооборотаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбратьРеквизитОбъектаДокументооборота();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗначениеРеквизитаПотребителяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ТипЗнч(ЗначениеРеквизитаПотребителя) = Тип("Число")
		Или ТипЗнч(ЗначениеРеквизитаПотребителя) = Тип("Дата") 
		Или ТипЗнч(ЗначениеРеквизитаПотребителя) = Тип("Булево") Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	ВыбратьЗначениеРеквизитаПотребителя(Элементы.ЗначениеРеквизитаПотребителя);
	
КонецПроцедуры

&НаКлиенте
Процедура ВычисляемоеВыражениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВыбратьВычисляемоеВыражение();
	
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда 
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ИмяРеквизитаОбъектаДокументооборота");
	Результат.Вставить("ПредставлениеРеквизитаОбъектаДокументооборота");
	Результат.Вставить("ЗначениеРеквизитаПотребителя");
	Результат.Вставить("ВычисляемоеВыражение");
	Результат.Вставить("Картинка");
	
	Если ВариантПравилаЗаполненияРеквизитов = РеквизитОбъекта Тогда 
		Результат.ИмяРеквизитаОбъектаДокументооборота = ИмяРеквизитаОбъектаДокументооборота;
		Результат.ПредставлениеРеквизитаОбъектаДокументооборота = ПредставлениеРеквизитаОбъектаДокументооборота;
		Результат.Картинка = 1;
		
	ИначеЕсли ВариантПравилаЗаполненияРеквизитов = УказанноеЗначение Тогда 
		Результат.ЗначениеРеквизитаПотребителя = ЗначениеРеквизитаПотребителя;
		Результат.Картинка = 2;
		
	ИначеЕсли ВариантПравилаЗаполненияРеквизитов = ВыражениеНаВстроенномЯзыке Тогда 
		Результат.ВычисляемоеВыражение = ВычисляемоеВыражение;
		Результат.Картинка = 3;
		
	КонецЕсли;
	
	Результат.Вставить("ВариантПравилаЗаполненияРеквизитов", ВариантПравилаЗаполненияРеквизитов);
	Результат.Вставить("ОбновлятьЗначение", ОбновлятьЗначение);
	Результат.Вставить("ДополнительныйРеквизитДокументооборота", ДополнительныйРеквизитДокументооборота);
	Результат.Вставить("ДополнительныйРеквизитДокументооборотаID", ДополнительныйРеквизитДокументооборотаID);
	Результат.Вставить("ДополнительныйРеквизитДокументооборотаТип", ДополнительныйРеквизитДокументооборотаТип);
	Результат.Вставить("Ключевой", Ключевой);
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьРеквизитОбъектаДокументооборота()
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТипОбъектаДокументооборота", ТипОбъектаДокументооборота);
	ПараметрыФормы.Вставить("РеквизитыОбъектаДокументооборота", РеквизитыОбъектаДокументооборота);
	ПараметрыФормы.Вставить("ИмяРеквизитаОбъектаДокументооборота", ИмяРеквизитаОбъектаДокументооборота);
	ПараметрыФормы.Вставить("ПредставлениеРеквизитаОбъектаПотребителя", ПредставлениеРеквизитаОбъектаПотребителя);
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьРеквизитОбъектаДокументооборотаЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Справочник.ПравилаИнтеграцииС1СДокументооборотом.Форма.ВыборРеквизитаДокументооборота",
		ПараметрыФормы, ЭтаФорма,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРеквизитОбъектаДокументооборотаЗавершение(Результат, ПараметрыОповещения) Экспорт

	Если ТипЗнч(Результат) = Тип("Структура") Тогда 
		Результат.Свойство("Имя", ИмяРеквизитаОбъектаДокументооборота);
		Результат.Свойство("Представление", ПредставлениеРеквизитаОбъектаДокументооборота);
		Результат.Свойство("ДополнительныйРеквизитДокументооборота", ДополнительныйРеквизитДокументооборота);
		Результат.Свойство("ДополнительныйРеквизитДокументооборотаID", ДополнительныйРеквизитДокументооборотаID);
		Результат.Свойство("ДополнительныйРеквизитДокументооборотаТип", ДополнительныйРеквизитДокументооборотаТип);
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеРеквизитаПотребителя(Элемент);
	
	Типы = ТипРеквизитаОбъектаПотребителя.Типы();
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("ОписаниеТипа", ТипРеквизитаОбъектаПотребителя);
	ПараметрыВыбора.Вставить("ТекстРедактирования", Элемент.ТекстРедактирования);
	
	Если Типы.Количество() = 1 Тогда 
		ВыбратьЗначениеРеквизитаПотребителяЗавершениеВыбораТипа(Типы[0], ПараметрыВыбора);
	Иначе
		Оповещение = Новый ОписаниеОповещения(
			"ВыбратьЗначениеРеквизитаПотребителяЗавершениеВыбораТипа",
			ЭтаФорма,
			ПараметрыВыбора);
		СписокТипов = Новый СписокЗначений;
		СписокТипов.ЗагрузитьЗначения(Типы);
		ПоказатьВыборИзСписка(Оповещение, СписокТипов, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеРеквизитаПотребителяЗавершениеВыбораТипа(ЗначениеТипа, ПараметрыВыбора) Экспорт
	
	ОписаниеТипа = ПараметрыВыбора.ОписаниеТипа;
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьЗначениеРеквизитаПотребителяЗавершениеВводаЗначения", ЭтаФорма);
	
	Если ЗначениеТипа = Тип("Строка") Тогда 
		ЗначениеРеквизита = ПараметрыВыбора.ТекстРедактирования;
		Если ОписаниеТипа.КвалификаторыСтроки.Длина = 0 Или ОписаниеТипа.КвалификаторыСтроки.Длина > 40 Тогда
			Многострочность = Истина;
		Иначе
			Многострочность = Ложь;
		КонецЕсли;
		
		ПоказатьВводСтроки(Оповещение, ЗначениеРеквизита, 
			ПредставлениеРеквизитаОбъектаПотребителя,
			ОписаниеТипа.КвалификаторыСтроки.Длина, 
			Многострочность); 
		
	ИначеЕсли ЗначениеТипа = Тип("Число") Тогда 
		ЗначениеРеквизита = ЗначениеРеквизитаПотребителя;
		ПоказатьВводЧисла(Оповещение, ЗначениеРеквизита, 
			ПредставлениеРеквизитаОбъектаПотребителя, 
			ОписаниеТипа.КвалификаторыЧисла.Разрядность, 
			ОписаниеТипа.КвалификаторыЧисла.РазрядностьДробнойЧасти);
			
	ИначеЕсли ЗначениеТипа = Тип("Дата") Тогда 
		ЗначениеРеквизита = ЗначениеРеквизитаПотребителя;
		ПоказатьВводДаты(Оповещение, ЗначениеРеквизита, 
			ПредставлениеРеквизитаОбъектаПотребителя, 
			ОписаниеТипа.КвалификаторыДаты.ЧастиДаты); 
		
	ИначеЕсли ЗначениеТипа = Тип("Булево") Тогда
		ЗначениеРеквизита = ЗначениеРеквизитаПотребителя;
		ПоказатьВводЗначения(Оповещение, ЗначениеРеквизита, ПредставлениеРеквизитаОбъектаПотребителя, Тип("Булево"));
		
	Иначе
		ИмяОбъекта = ИмяОбъектаМетаданныхПоТипу(ЗначениеТипа);
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора", Истина);
		ПараметрыФормы.Вставить("ТекущаяСтрока", ЗначениеРеквизитаПотребителя);
		Если ИмяОбъекта = "Справочник.ЗначенияСвойствОбъектов" Тогда
			Отбор = Новый Структура("Владелец", ДополнительныйРеквизитОбъектаСвойство);
			ПараметрыФормы.Вставить("Отбор", Отбор);
		КонецЕсли; 
		ОткрытьФорму(ИмяОбъекта + ".ФормаВыбора", ПараметрыФормы, ЭтаФорма,,,,
			Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеРеквизитаПотребителяЗавершениеВводаЗначения(Результат, ПараметрыОповещения) Экспорт
	
	Если Результат <> Неопределено Тогда
		ЗначениеРеквизитаПотребителя = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВычисляемоеВыражение();
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВычисляемоеВыражение", ВычисляемоеВыражение);
	ПараметрыФормы.Вставить("ТипВыражения", "ПравилоЗагрузки");
	ПараметрыФормы.Вставить("ТипОбъектаДокументооборота", ТипОбъектаДокументооборота);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьВычисляемоеВыражениеЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Справочник.ПравилаИнтеграцииС1СДокументооборотом.Форма.ВыражениеНаВстроенномЯзыке",
		ПараметрыФормы, ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВычисляемоеВыражениеЗавершение(Результат, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Строка") Тогда 
		ВычисляемоеВыражение = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	Элементы.ПредставлениеРеквизитаОбъектаДокументооборота.Доступность = (ВариантПравилаЗаполненияРеквизитов = РеквизитОбъекта);
	Элементы.ПредставлениеРеквизитаОбъектаДокументооборота.АвтоОтметкаНезаполненного = 
		(ВариантПравилаЗаполненияРеквизитов = РеквизитОбъекта);
	Элементы.ПредставлениеРеквизитаОбъектаДокументооборота.ОтметкаНезаполненного = 
		(ВариантПравилаЗаполненияРеквизитов = РеквизитОбъекта) И Не ЗначениеЗаполнено(ПредставлениеРеквизитаОбъектаДокументооборота);
	
	Элементы.ЗначениеРеквизитаПотребителя.Доступность = (ВариантПравилаЗаполненияРеквизитов = УказанноеЗначение);
	Элементы.ЗначениеРеквизитаПотребителя.АвтоОтметкаНезаполненного = (ВариантПравилаЗаполненияРеквизитов = УказанноеЗначение);
	Элементы.ЗначениеРеквизитаПотребителя.ОтметкаНезаполненного = 
		(ВариантПравилаЗаполненияРеквизитов = УказанноеЗначение) И Не ЗначениеЗаполнено(ЗначениеРеквизитаПотребителя);
	
	Элементы.ВычисляемоеВыражение.Доступность = (ВариантПравилаЗаполненияРеквизитов = ВыражениеНаВстроенномЯзыке);
	Элементы.ВычисляемоеВыражение.АвтоОтметкаНезаполненного = (ВариантПравилаЗаполненияРеквизитов = ВыражениеНаВстроенномЯзыке);
	Элементы.ВычисляемоеВыражение.ОтметкаНезаполненного = 
		(ВариантПравилаЗаполненияРеквизитов = ВыражениеНаВстроенномЯзыке) И Не ЗначениеЗаполнено(ВычисляемоеВыражение);
	
	Элементы.ОбновлятьЗначение.Доступность = НЕ ВариантПравилаЗаполненияРеквизитов = УказанноеЗначение;
	ОбновлятьЗначение = ОбновлятьЗначение И НЕ ВариантПравилаЗаполненияРеквизитов = УказанноеЗначение;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если ВариантПравилаЗаполненияРеквизитов = Перечисления.ВариантыПравилЗаполненияРеквизитов.РеквизитОбъекта Тогда 
		ПроверяемыеРеквизиты.Добавить("ПредставлениеРеквизитаОбъектаДокументооборота");
		
	ИначеЕсли ВариантПравилаЗаполненияРеквизитов = Перечисления.ВариантыПравилЗаполненияРеквизитов.УказанноеЗначение Тогда 
		ПроверяемыеРеквизиты.Добавить("ЗначениеРеквизитаПотребителя");
		
	ИначеЕсли ВариантПравилаЗаполненияРеквизитов = Перечисления.ВариантыПравилЗаполненияРеквизитов.ВыражениеНаВстроенномЯзыке Тогда 
		ПроверяемыеРеквизиты.Добавить("ВычисляемоеВыражение");
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ИмяОбъектаМетаданныхПоТипу(ТипОбъекта)
	
	Возврат Метаданные.НайтиПоТипу(ТипОбъекта).ПолноеИмя();

КонецФункции

#КонецОбласти
